CREATE DATABASE BeerDB;

CREATE TABLE Orders(
ID INT NOT NULL PRIMARY KEY,
BrandBeer NVARCHAR(40) NOT NULL,
Packaging NVARCHAR(30) NOT NULL,
RequestedQuantity INT NOT NULL,
DateOfTheOrder DATE NOT NULL,
Status NVARCHAR(20) NOT NULL,
Price MONEY NOT NULL
);

INSERT INTO Orders
VALUES (1, 'Леденика тъмно', 'наливно', 3300, '2005-7-10', 'изпълнена', 0.45),
		(2, 'Амстел', 'кутия', 200, '2005-7-9', 'изпълнена', 1.05),
		(3, 'Загорка екстра', 'бутилка', 4800, '2005-8-15','за изпълнение', 0.9),
		(4, 'Астика екстра', 'кутия', 4600, '2005-7-12', 'изпълнена', 0.95),
		(5, 'Леденика екстра', 'наливно', 800, '2005-7-6', 'изпълнена', 0.45),
		(6, 'Амстел екстра', 'кутия', 300, '2005-8-18', 'за изпълнение', 0.95),
		(7, 'Леденика светло', 'наливно', 12370, '2005-8-19', 'за изпълнение', 0.45),
		(8, 'Старопрамен светло', 'кутия', 50, '2005-7-10', 'изпълнена', 1.05),
		(9, 'Блейд ейл', 'бутилка', 480, '2005-7-17', 'за изпълнение', 0.90),
		(10, 'Загорка тъмно', 'бутилка', 3500, '2005-8-12', 'за изпълнение', 0.9),
		(11, 'Загорка светло', 'кутия', 480, '2005-7-17', 'изпълнена', 1.05),
		(12, 'Дондее', 'бутилка', 5890, '2005-8-16', 'за изпълнение', 0.95);