--1
CREATE DATABASE BooksDB;

--2
CREATE TABLE Books(
ID INT NOT NULL PRIMARY KEY,
Title NVARCHAR(40) NOT NULL,
Author NVARCHAR(60) NOT NULL,
Publisher NVARCHAR(15) NOT NULL,
Pages INT,
Price MONEY NOT NULL,
Quantity INT NOT NULL
);

--3
INSERT INTO Books
VALUES (1, 'Огън и кръв', 'Джордж Р. Р. Мартин', 'Бард', 592, 24.99, 120),
		(2, 'Разказът на прислужницата', 'Маргарет Атууд', 'Orange books', 416, 19.90, 200),
		(3, 'След', 'Анна Тод', 'Егмонт', 670, 24.90, 128),
		(4, 'Заветите', 'Маргарет Атууд', 'Orange books', 536, 24.90, 65),
		(5, 'Всичко, което сме заедно', 'Алис Келен', 'Егмонт', 432, 17.90, 25),
		(6, 'Орикс и Крейк', 'Маргарет Атууд', 'Orange books', 512, 25.90, 33),
		(7, 'Измамна реалност', 'Стойчо Керев', 'Бард', 320, 21.99, 15),
		(8, 'Досието Одеса', 'Фредерик Форсайт', 'Бард', 384, 17.99, 25),
		(9, 'Опашката', 'Захари Карабашлиев', 'Сиела', 400, 18.90, 8),
		(10, 'Гръцко синьо - Не съвсем пътеводител', 'Анита Димитрова', 'Сиела', 312, 25, 5),
		(11, 'Мисия Туран', 'Алек Попов', 'Сиела', 412, 18.90, 12),
		(12, 'Дяволската алтернатива', 'Фредерик Форсайт', 'Бард', 560, 19.99, 0);